import { MagicSchool, MagicSchoolType } from './magic-school.model';

export const MAGIC_SCHOOLS: MagicSchool[] = [
  {
    type: MagicSchoolType.Agony,
    name: 'Agony (Агония)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
  {
    type: MagicSchoolType.Alchemy,
    name: 'Alchemy (Алхимия)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
  {
    type: MagicSchoolType.Hex,
    name: 'Hex (Ворожба)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
  {
    type: MagicSchoolType.Technomancy,
    name: 'Technomancy (Техномантия)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
  {
    type: MagicSchoolType.Nightmare,
    name: 'Nightmare (Кошмары)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
  {
    type: MagicSchoolType.Shamanic,
    name: 'Shamanic (Шаманизм)',
    description: 'Эта школа фокусируется на призыве тотемов и использовании их в качестве отправной точки для мощных заклинаний, которые позволяют вам размещать и/или решать квесты. Шаманская магия - это мирная магия, которая не желает причинять вред другим магам.',
  },
];
